# Задача 1

a = 1
print(a)
b = 'Python'
print(b)

name = input('Введите имя: ')
print(name)

# Задача 2

number = int(input('Введите число: '))
print(number + 2)

# Задача 3

age = int(input('Введите возраст: '))
if age >= 18:
    print('Доступ разрешен')
else:
    print('Извините, пользование данным ресурсом только с 18 лет')
